import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:get/get.dart';
import 'package:flutter/material.dart';

class ProductController extends GetxController {
  RxInt index = 0.obs;
  List<List<Widget>> images = [
    [
      Image.asset(
        'assets/images_temp/7.jpeg',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/8.jpeg',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/9.jpg',
        fit: BoxFit.cover,
      ),
    ],
    [
      Image.asset(
        'assets/images_temp/10.jpg',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/11.jpg',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/12.jpg',
        fit: BoxFit.cover,
      ),
    ],
    [
      Image.asset(
        'assets/images_temp/13.jpg',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/14.jpg',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/15.jpg',
        fit: BoxFit.cover,
      ),
    ],
    [
      Image.asset(
        'assets/images_temp/16.jpeg',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/17.jpg',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/18.jpg',
        fit: BoxFit.cover,
      ),
    ],
    [
      Image.asset(
        'assets/images_temp/19.png',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/20.jpg',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/21.webp',
        fit: BoxFit.cover,
      ),
    ],
    [
      Image.asset(
        'assets/images_temp/22.jpg',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/23.jpg',
        fit: BoxFit.cover,
      ),
      Image.asset(
        'assets/images_temp/24.jpg',
        fit: BoxFit.cover,
      ),
    ]
  ].obs;
  List<String> title =
      ['이로아케이크', '스노우케이크', '빈야드케이크', '마법학교케이크', '라플레아르띠', '앙플리케이크'].obs;
  List<String> description = [
    '부산에서 입소문난 수제디저트 공방이에요~',
    '기억하고 싶은 오늘을 디자인합니다.',
    '추억으로의 여행, 매일 오늘같기를~',
    '감사한 분, 생일인 분, 사랑하는 분에게~',
    '케이터링으로 제작된 프리미엄 플라워쿠키 입니다.',
    '생화처럼 디테일이 남다른 케이크를 만나보세요'
  ].obs;
  List<double> rating = [4.5, 4.0, 3.5, 2.0, 3.5, 4.0].obs;
  List<int> reviewCount = [1234, 978, 1532, 1781, 512, 885].obs;
  List<int> price = [29500, 27000, 31000, 30000, 26000, 29000].obs;
  List<String> productDescription = [
    '⚘﻿﻿러블리 리스 앙금플라워떡케이크⚘\n\n전직 시각디자이너의 감각으로\n세련된 색감과 생화처럼 디테일이 남다른\n최고급 프리미엄 앙금플라워케이크를 만나보세요\n\n타 앙금플라워케이크와는 차별화된\n섬세한 터치가 배로 들어간 파이핑기법으로\n' +
        '생화에 최대한 가깝게 고퀄리티로 만들어집니다\n\n\n\n⚘⚘⚘\n앙금플라워떡케이크 주문 전 필독해주세요\n\n꼭 행사일 기준으로 예약해주세요\n앙금플라워 떡 케이크는\n당일 이후에는 굳을 수 있습니다.\n' +
        '쓰이는날 픽업 원칙으로 제작해드립니다\n떡케이크를 픽업하신 그대로 실온보관 또는\n서늘한 곳에 보관해 주세요.\n케이크를 드시고 남을 경우\n앙금크림과 떡은 따로 분리하여\n' +
        '냉동실에 보관 하신 뒤\n앙금은 실온 또는 전자레인지\n떡은 찜기 또는 전자레인지에 데워 드세요\n\n\n⚘⚘⚘\n주문 시 최소 2주~3일전까지 상담 예약 후\n결제완료 해주세요\n\n' +
        '클래스와 주문 병행으로 사전에\n조기마감 될 수 있으니 미리 상담 후 결제 부탁드립니다\n\n\n\n사이즈\n※1~4호까지가능\n\n*지름사이즈*\n1호 15cm(2~3인용) / 2호18cm(3~5인용)\n' +
        '3호 21cm(5~8인용) / 4호 24cm(8~10인용)\n높이5cm\n\n🌸설기종류선택🌸\n1.기본(흑당설기)-흑설탕+호두\n2.블루베리설기-블루베리필링\n3.무화과설기-무화과쨈필링\n' +
        '4.쑥설기-흑설탕+호두\n5.흑임자설기-흑임자필링\n\n🌸필독🌸\n앙금플라워는 수작업이므로\n샘플케이크와 100프로 똑같이 만들기어렵습니다\n꽃스타일, 꽃의갯수는 호수와 분위기에 따라 달라집니다\n최대한 비슷한 느낌으로 조화롭게 해드릴게요^^\n\n' +
        '🌸픽업안내🌸\n제품특성상 픽업원칙이며 픽업 불가시 다마스퀵으로\n보내드릴 수 있으며 배송료는 고객님부담입니다\n\n\n\n\n',
    '⚘﻿﻿러블리 리스 앙금플라워떡케이크⚘\n\n전직 시각디자이너의 감각으로\n세련된 색감과 생화처럼 디테일이 남다른\n최고급 프리미엄 앙금플라워케이크를 만나보세요\n\n타 앙금플라워케이크와는 차별화된\n섬세한 터치가 배로 들어간 파이핑기법으로\n' +
        '생화에 최대한 가깝게 고퀄리티로 만들어집니다\n\n\n\n⚘⚘⚘\n앙금플라워떡케이크 주문 전 필독해주세요\n\n꼭 행사일 기준으로 예약해주세요\n앙금플라워 떡 케이크는\n당일 이후에는 굳을 수 있습니다.\n' +
        '쓰이는날 픽업 원칙으로 제작해드립니다\n떡케이크를 픽업하신 그대로 실온보관 또는\n서늘한 곳에 보관해 주세요.\n케이크를 드시고 남을 경우\n앙금크림과 떡은 따로 분리하여\n' +
        '냉동실에 보관 하신 뒤\n앙금은 실온 또는 전자레인지\n떡은 찜기 또는 전자레인지에 데워 드세요\n\n\n⚘⚘⚘\n주문 시 최소 2주~3일전까지 상담 예약 후\n결제완료 해주세요\n\n' +
        '클래스와 주문 병행으로 사전에\n조기마감 될 수 있으니 미리 상담 후 결제 부탁드립니다\n\n\n\n사이즈\n※1~4호까지가능\n\n*지름사이즈*\n1호 15cm(2~3인용) / 2호18cm(3~5인용)\n' +
        '3호 21cm(5~8인용) / 4호 24cm(8~10인용)\n높이5cm\n\n🌸설기종류선택🌸\n1.기본(흑당설기)-흑설탕+호두\n2.블루베리설기-블루베리필링\n3.무화과설기-무화과쨈필링\n' +
        '4.쑥설기-흑설탕+호두\n5.흑임자설기-흑임자필링\n\n🌸필독🌸\n앙금플라워는 수작업이므로\n샘플케이크와 100프로 똑같이 만들기어렵습니다\n꽃스타일, 꽃의갯수는 호수와 분위기에 따라 달라집니다\n최대한 비슷한 느낌으로 조화롭게 해드릴게요^^\n\n' +
        '🌸픽업안내🌸\n제품특성상 픽업원칙이며 픽업 불가시 다마스퀵으로\n보내드릴 수 있으며 배송료는 고객님부담입니다\n\n\n\n\n',
    '⚘﻿﻿러블리 리스 앙금플라워떡케이크⚘\n\n전직 시각디자이너의 감각으로\n세련된 색감과 생화처럼 디테일이 남다른\n최고급 프리미엄 앙금플라워케이크를 만나보세요\n\n타 앙금플라워케이크와는 차별화된\n섬세한 터치가 배로 들어간 파이핑기법으로\n' +
        '생화에 최대한 가깝게 고퀄리티로 만들어집니다\n\n\n\n⚘⚘⚘\n앙금플라워떡케이크 주문 전 필독해주세요\n\n꼭 행사일 기준으로 예약해주세요\n앙금플라워 떡 케이크는\n당일 이후에는 굳을 수 있습니다.\n' +
        '쓰이는날 픽업 원칙으로 제작해드립니다\n떡케이크를 픽업하신 그대로 실온보관 또는\n서늘한 곳에 보관해 주세요.\n케이크를 드시고 남을 경우\n앙금크림과 떡은 따로 분리하여\n' +
        '냉동실에 보관 하신 뒤\n앙금은 실온 또는 전자레인지\n떡은 찜기 또는 전자레인지에 데워 드세요\n\n\n⚘⚘⚘\n주문 시 최소 2주~3일전까지 상담 예약 후\n결제완료 해주세요\n\n' +
        '클래스와 주문 병행으로 사전에\n조기마감 될 수 있으니 미리 상담 후 결제 부탁드립니다\n\n\n\n사이즈\n※1~4호까지가능\n\n*지름사이즈*\n1호 15cm(2~3인용) / 2호18cm(3~5인용)\n' +
        '3호 21cm(5~8인용) / 4호 24cm(8~10인용)\n높이5cm\n\n🌸설기종류선택🌸\n1.기본(흑당설기)-흑설탕+호두\n2.블루베리설기-블루베리필링\n3.무화과설기-무화과쨈필링\n' +
        '4.쑥설기-흑설탕+호두\n5.흑임자설기-흑임자필링\n\n🌸필독🌸\n앙금플라워는 수작업이므로\n샘플케이크와 100프로 똑같이 만들기어렵습니다\n꽃스타일, 꽃의갯수는 호수와 분위기에 따라 달라집니다\n최대한 비슷한 느낌으로 조화롭게 해드릴게요^^\n\n' +
        '🌸픽업안내🌸\n제품특성상 픽업원칙이며 픽업 불가시 다마스퀵으로\n보내드릴 수 있으며 배송료는 고객님부담입니다\n\n\n\n\n',
    '⚘﻿﻿러블리 리스 앙금플라워떡케이크⚘\n\n전직 시각디자이너의 감각으로\n세련된 색감과 생화처럼 디테일이 남다른\n최고급 프리미엄 앙금플라워케이크를 만나보세요\n\n타 앙금플라워케이크와는 차별화된\n섬세한 터치가 배로 들어간 파이핑기법으로\n' +
        '생화에 최대한 가깝게 고퀄리티로 만들어집니다\n\n\n\n⚘⚘⚘\n앙금플라워떡케이크 주문 전 필독해주세요\n\n꼭 행사일 기준으로 예약해주세요\n앙금플라워 떡 케이크는\n당일 이후에는 굳을 수 있습니다.\n' +
        '쓰이는날 픽업 원칙으로 제작해드립니다\n떡케이크를 픽업하신 그대로 실온보관 또는\n서늘한 곳에 보관해 주세요.\n케이크를 드시고 남을 경우\n앙금크림과 떡은 따로 분리하여\n' +
        '냉동실에 보관 하신 뒤\n앙금은 실온 또는 전자레인지\n떡은 찜기 또는 전자레인지에 데워 드세요\n\n\n⚘⚘⚘\n주문 시 최소 2주~3일전까지 상담 예약 후\n결제완료 해주세요\n\n' +
        '클래스와 주문 병행으로 사전에\n조기마감 될 수 있으니 미리 상담 후 결제 부탁드립니다\n\n\n\n사이즈\n※1~4호까지가능\n\n*지름사이즈*\n1호 15cm(2~3인용) / 2호18cm(3~5인용)\n' +
        '3호 21cm(5~8인용) / 4호 24cm(8~10인용)\n높이5cm\n\n🌸설기종류선택🌸\n1.기본(흑당설기)-흑설탕+호두\n2.블루베리설기-블루베리필링\n3.무화과설기-무화과쨈필링\n' +
        '4.쑥설기-흑설탕+호두\n5.흑임자설기-흑임자필링\n\n🌸필독🌸\n앙금플라워는 수작업이므로\n샘플케이크와 100프로 똑같이 만들기어렵습니다\n꽃스타일, 꽃의갯수는 호수와 분위기에 따라 달라집니다\n최대한 비슷한 느낌으로 조화롭게 해드릴게요^^\n\n' +
        '🌸픽업안내🌸\n제품특성상 픽업원칙이며 픽업 불가시 다마스퀵으로\n보내드릴 수 있으며 배송료는 고객님부담입니다\n\n\n\n\n',
    '⚘﻿﻿러블리 리스 앙금플라워떡케이크⚘\n\n전직 시각디자이너의 감각으로\n세련된 색감과 생화처럼 디테일이 남다른\n최고급 프리미엄 앙금플라워케이크를 만나보세요\n\n타 앙금플라워케이크와는 차별화된\n섬세한 터치가 배로 들어간 파이핑기법으로\n' +
        '생화에 최대한 가깝게 고퀄리티로 만들어집니다\n\n\n\n⚘⚘⚘\n앙금플라워떡케이크 주문 전 필독해주세요\n\n꼭 행사일 기준으로 예약해주세요\n앙금플라워 떡 케이크는\n당일 이후에는 굳을 수 있습니다.\n' +
        '쓰이는날 픽업 원칙으로 제작해드립니다\n떡케이크를 픽업하신 그대로 실온보관 또는\n서늘한 곳에 보관해 주세요.\n케이크를 드시고 남을 경우\n앙금크림과 떡은 따로 분리하여\n' +
        '냉동실에 보관 하신 뒤\n앙금은 실온 또는 전자레인지\n떡은 찜기 또는 전자레인지에 데워 드세요\n\n\n⚘⚘⚘\n주문 시 최소 2주~3일전까지 상담 예약 후\n결제완료 해주세요\n\n' +
        '클래스와 주문 병행으로 사전에\n조기마감 될 수 있으니 미리 상담 후 결제 부탁드립니다\n\n\n\n사이즈\n※1~4호까지가능\n\n*지름사이즈*\n1호 15cm(2~3인용) / 2호18cm(3~5인용)\n' +
        '3호 21cm(5~8인용) / 4호 24cm(8~10인용)\n높이5cm\n\n🌸설기종류선택🌸\n1.기본(흑당설기)-흑설탕+호두\n2.블루베리설기-블루베리필링\n3.무화과설기-무화과쨈필링\n' +
        '4.쑥설기-흑설탕+호두\n5.흑임자설기-흑임자필링\n\n🌸필독🌸\n앙금플라워는 수작업이므로\n샘플케이크와 100프로 똑같이 만들기어렵습니다\n꽃스타일, 꽃의갯수는 호수와 분위기에 따라 달라집니다\n최대한 비슷한 느낌으로 조화롭게 해드릴게요^^\n\n' +
        '🌸픽업안내🌸\n제품특성상 픽업원칙이며 픽업 불가시 다마스퀵으로\n보내드릴 수 있으며 배송료는 고객님부담입니다\n\n\n\n\n',
    '⚘﻿﻿러블리 리스 앙금플라워떡케이크⚘\n\n전직 시각디자이너의 감각으로\n세련된 색감과 생화처럼 디테일이 남다른\n최고급 프리미엄 앙금플라워케이크를 만나보세요\n\n타 앙금플라워케이크와는 차별화된\n섬세한 터치가 배로 들어간 파이핑기법으로\n' +
        '생화에 최대한 가깝게 고퀄리티로 만들어집니다\n\n\n\n⚘⚘⚘\n앙금플라워떡케이크 주문 전 필독해주세요\n\n꼭 행사일 기준으로 예약해주세요\n앙금플라워 떡 케이크는\n당일 이후에는 굳을 수 있습니다.\n' +
        '쓰이는날 픽업 원칙으로 제작해드립니다\n떡케이크를 픽업하신 그대로 실온보관 또는\n서늘한 곳에 보관해 주세요.\n케이크를 드시고 남을 경우\n앙금크림과 떡은 따로 분리하여\n' +
        '냉동실에 보관 하신 뒤\n앙금은 실온 또는 전자레인지\n떡은 찜기 또는 전자레인지에 데워 드세요\n\n\n⚘⚘⚘\n주문 시 최소 2주~3일전까지 상담 예약 후\n결제완료 해주세요\n\n' +
        '클래스와 주문 병행으로 사전에\n조기마감 될 수 있으니 미리 상담 후 결제 부탁드립니다\n\n\n\n사이즈\n※1~4호까지가능\n\n*지름사이즈*\n1호 15cm(2~3인용) / 2호18cm(3~5인용)\n' +
        '3호 21cm(5~8인용) / 4호 24cm(8~10인용)\n높이5cm\n\n🌸설기종류선택🌸\n1.기본(흑당설기)-흑설탕+호두\n2.블루베리설기-블루베리필링\n3.무화과설기-무화과쨈필링\n' +
        '4.쑥설기-흑설탕+호두\n5.흑임자설기-흑임자필링\n\n🌸필독🌸\n앙금플라워는 수작업이므로\n샘플케이크와 100프로 똑같이 만들기어렵습니다\n꽃스타일, 꽃의갯수는 호수와 분위기에 따라 달라집니다\n최대한 비슷한 느낌으로 조화롭게 해드릴게요^^\n\n' +
        '🌸픽업안내🌸\n제품특성상 픽업원칙이며 픽업 불가시 다마스퀵으로\n보내드릴 수 있으며 배송료는 고객님부담입니다\n\n\n\n\n',
  ].obs;

  List<List<bool>> optionCheck = [
    [
      false,
      false,
      false,
      false,
    ].obs,
    [
      false,
      false,
      false,
    ].obs,
    [
      false,
      false,
      false,
      false,
    ].obs,
    [
      false,
      false,
    ].obs,
  ].obs;

  onFirstClicked(int firstIndex, int secondIndex) {
    for (int i = 0; i < optionCheck[firstIndex].length; i++) {
      optionCheck[firstIndex][i] = false;
    }

    optionCheck[firstIndex][secondIndex] = true;
    print(optionCheck[firstIndex]);
  }

  init() {
    for(int i=0;i<4;i++){
      for(int j=0;j<optionCheck[i].length;j++){
        optionCheck[i][j] = false;
      }
    }
  }
}
